const_columns = {
    'Код': 'Код',
    'Кол': 'Кол'
}



sheet_name = 'Запрос'

new_columns_dict = {
    'Свободный остаток':'Свободный \nостаток',
    'Свободный остаток - Кол':'Свободный остаток -\nКол',
    'Свободные поступления': 'Свободные \nпоступления',
    'Свободный остаток - Свободные поступления - Кол': 'Свободный остаток -\nСвободные поступления -\nКол',
    'Информация о поступлениях': 'Информация о \nпоступлениях',

    'Прайс без НДС': 'Прайс без НДС',
    'Итого без НДС': 'Итого без НДС',
    'Описание':'Описание',
    'ЕдИзм':'ЕдИзм',
    'V': 'Версия Магадель',

}