distributor_products_keaz_optima = [
    "OptiBox P", "OptiDin BM125", "OptiDin BM63 (6кА и 4,5 кА)", "OptiDin BM63 DC",
    "OptiDin BM63-OT", "OptiDin D63 (6кА и 4,5 кА)", "OptiDin OM УЗИП",
    "OptiDin OM УЗИП (заказные)", "OptiDin SL63 Лампы сигнальные", "OptiDin VD63",
    "OptiDin ZM Звонки модульные", "OptiDin Аксессуары", "OptiDin КМ63 Кнопки модульные",
    "OptiDin РА10", "OptiDin Реле модульные", "OptiDin DM63", "OptiDin MK100",
    "OptiDin BM63PL", "OptiStart LC1E", "OptiStart ME", "OptiStart K", "OptiStart MP",
    "OptiFuse", "OptiMat D", "OptiMat D Аксессуары", "OptiMat E Аксессуары",
    "OptiMat E100", "OptiMat E250", "Optiswitch 4G", "Optiswitch DI", "OptiKit",
    "OptiRel G", "OptiRel D", "OptiSignal", "OptiSensor LS", "OptiCor",
    "OptiPower DR", "OptiPower MDR", "OptiPower LRS", "OptiClip", "OptiLogic L",
    "OptiLogic M", "OptiLogic S"
]

distributor_products_keaz = [
    "КПВ", "КТПВ", "ВНК", "ЗБ Замки", "КЭЗ Ключи", "ПКТ", "Разъединители высоковольтные",
    "А63", "АВДТ32", "АД", "АЕ20", "АЕ20М", "Аксессуары выключателей",
    "Аксессуары предохранителей", "АП50Б", "ВА04-36", "ВА13", "ВА21", "ВА47-100",
    "ВА47-29", "ВА47 Аксессуары для модульных выключателей", "ВА51-35", "ВА51-39",
    "ВА57-31", "ВА57-35", "ВА57-35 Ф", "ВА57-39", "ВА57Ф31", "ВД1-63", "ВН-32",
    "ВР-32", "ВР-32 (заказные)", "ВР-32ф", "Выключатели путевые", "ИТТ",
    "КИП Коробки испытательные переходные", "Комплекты зажимов", "Корпуса НКУ - металл",
    "КТ6000", "КТ6000 Аксессуары", "НПН2", "ПАР", "Контакторы КМ", "ПМ12 Контакторы",
    "ПМ12 Пускатели", "ПМЛ Аксессуары", "ПМЛ Аксессуары (заказные)", "ПМЛ Контакторы",
    "ПМЛ Контакторы (заказные)", "ПМЛ Пускатели", "ПМЛ Пускатели (заказные)",
    "ПРК Пускатели", "ПН2", "ПН2 Аксессуары", "ППН", "ППН Аксессуары",
    "ППН Аксессуары покупные", "ППН Х3", "Разъемы силовые", "РЕ19", "РЕ19 Аксессуары",
    "РП Рубильники", "РТЛ Реле", "РТЛ Реле (заказные)", "Светосигнальные индикаторы",
    "Средства монтажа, аксессуары НКУ", "Устройства подачи команд и сигналов",
    "ЯРП Ящики силовые", "ВА50 Аксессуары", "ВА53-41", "ВА53-43", "ВА55-41",
    "ВА55-43", "ПП 57", "ПП60С", "ПНБ5", "ПНБ7", "KEAZ-Ferraz",
    "Продукты вне канала распределения", "АК50Б", "АК50КБ", "АК50КБ-Д",
    "АК50КБ РЕГ"
]

project_products_keaz_optima = [
    "OptiMat A", "OptiBox G", "OptiMat ВВ", "OptiBox M", "Ретрофит (Оптимат А, Д, ВА50)",
    "OptiBlock", "OptiVert", "OptiSave"
]
exceptions_BA = [
    'ВА57', 'ВА57Ф','ВА51','ВА04'
]

all_products = {
    "Дистрибуторские продукты KEAZ-Optima": distributor_products_keaz_optima,
    "Дистрибуторские продукты КЭАЗ": distributor_products_keaz,
    "Проектные продукты KEAZ-Optima": project_products_keaz_optima
}

